# SetMtlFillStyleByCls

## Description
```pascal
FUNCTION SetMtlFillStyleByCls(
				materialHandle : HANDLE;
				isByClass      : BOOLEAN) : BOOLEAN;
```

```python

def vs.SetMtlFillStyleByCls(materialHandle, isByClass):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|materialHandle|HANDLE||
|isByClass|BOOLEAN||

## Version
Availability: from Vectorworks 2021
## Category
* Object Attributes